In [3]:
import pandas as pd
import numpy as np

In [7]:
dates = pd.date_range("20130101", periods=8)

In [9]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=list("'sree', 'sree1', 'sree2', 'sree3'".split(',')))

In [10]:
df

              'sree'   'sree1'   'sree2'   'sree3'
2013-01-01 -1.538239 -1.432869 -0.701947 -0.771734
2013-01-02 -2.309751  0.899184 -0.824395  0.188826
2013-01-03 -0.057569  0.470952 -0.058619 -1.455083
2013-01-04 -0.635655  0.323202  1.532147  0.414646
2013-01-05 -1.074711 -0.312379 -1.600097  1.429559
2013-01-06  0.709792 -0.573318 -1.402403  1.073215
2013-01-07  1.982909  1.697438 -0.793123  0.231737
2013-01-08  1.352541  1.043959 -0.849004  0.536013

In [12]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df2.drop(index=1)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [18]:
df3=pd.DataFrame(np.random.randn(8, 4),columns=list('ABCD'))

In [19]:
df3

          A         B         C         D
0 -2.279173 -0.009027  0.040722  0.143120
1  1.800065 -0.294401 -0.342776  0.677451
2  0.832358 -0.275172 -1.341436  0.831768
3  0.394805 -0.127694 -0.257664 -1.430899
4  0.243886 -0.894495  0.419459 -0.846542
5  0.110178  1.749338  0.001956 -2.525250
6  1.443387 -1.155428 -0.321723 -1.327439
7  1.652900  2.930021 -0.380341  0.428911

In [25]:
df3.drop(columns='A',index=1)

          B         C         D
0 -0.009027  0.040722  0.143120
2 -0.275172 -1.341436  0.831768
3 -0.127694 -0.257664 -1.430899
4 -0.894495  0.419459 -0.846542
5  1.749338  0.001956 -2.525250
6 -1.155428 -0.321723 -1.327439
7  2.930021 -0.380341  0.428911

In [26]:
df3

          A         B         C         D
0 -2.279173 -0.009027  0.040722  0.143120
1  1.800065 -0.294401 -0.342776  0.677451
2  0.832358 -0.275172 -1.341436  0.831768
3  0.394805 -0.127694 -0.257664 -1.430899
4  0.243886 -0.894495  0.419459 -0.846542
5  0.110178  1.749338  0.001956 -2.525250
6  1.443387 -1.155428 -0.321723 -1.327439
7  1.652900  2.930021 -0.380341  0.428911

In [29]:
df6=pd.DataFrame(np.random.randn(8, 4),columns=list('ABCD'))

In [31]:
df6.drop(index=1,columns='A')

          B         C         D
0  0.216392  1.003934 -0.044395
2  0.137835  1.076882  1.131640
3 -1.471299 -0.125041  1.146519
4  0.009449  0.089339  0.199951
5  1.125182 -0.723651  0.947958
6  0.326479  1.072972  0.855669
7 -0.739205  1.172151 -1.507759

In [33]:
df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  index=[4, 5, 6], columns=['A', 'B', 'C'])
df

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [34]:
df.at[4, 'A']

0

In [39]:
df.loc[6].at['B']

20

In [40]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [43]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [44]:
df.loc['cobra', 'shield']

2

In [45]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [49]:
df.loc[df['shield'] > 6]

            max_speed  shield
sidewinder          7       8